---
kind: method
id: M:Autodesk.Revit.DB.PropertySetElement.GetThermalAsset
source: html/583969ee-8bae-89f7-9a1c-40716ab359c0.htm
---
# Autodesk.Revit.DB.PropertySetElement.GetThermalAsset Method

Gets a copy of the ThermalAsset.

## Syntax (C#)
```csharp
public ThermalAsset GetThermalAsset()
```